# Отчёт по лабораторной работе №9 по курсу “Фундаментальная информатика”

<b>Студент группы:</b> <ins>M80-108Б-22, Рамалданов Рустамхан Ражудинович, № по списку 17</ins> 

<b>Контакты e-mail:</b> <ins>mrpepelulka@gmail.com</ins>

<b>Работа выполнена:</b> «19» <ins>сентября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>______</ins>

<b>Отчет сдан</b> «1» <ins>октября</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins>______</ins>

<b>Подпись преподавателя:</b> ________________

## 1. Тема
Системы программирования на языке Си.
## 2. Цель работы
Составление и отладка простейшей программы на языке Си итеративного характера с целочисленными рекуррентными соотношениями.
## 3. Задание (Вариант 17)
Написать программу на Си, моделирующую движение точки на плоскости с течением времени.
## 4. Оборудование:
<b>Процессор:</b> 11th Gen intel(R) Core(TM) i5-11400H @ 2.70GHz<br/>
<b>ОП:</b> 16 ГБ<br/>
<b>SSD:</b> 512 ГБ<br/>
<b>Адрес:</b> 192.168.56.1 <br/>
<b>Монитор:</b> 1920x1080<br/>
<b>Графика:</b> Nvidia GeForce RTX 3050 Ti Laptop GPU <br/>

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> linux(ubuntu) версии 5.15.0-47-generic<br/>
<b>Интерпретатор команд:</b> bash версия 5.1.16<br/>
<b>Система программирования:</b> не использовалась версия —<br/>
<b>Редактор текстов:</b> emacs версия 25.2.2<br/>
<b>Утилиты операционной системы:</b> nano, ls, cd, touch, gcc <br/>
<b>Прикладные системы и программы:</b> GNU C compiler <br/>
<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b> /home/pepelulka<br/>

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)

С каждой итерацией будем менять значения переменных по заданным правилам, пока наша точка не попадет в заданную область. Если через 50 шагов этого не произойдет, мы выведем сообщение о том, что точка не попала в нужную область.

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 

Код программы: 
```
#include <stdio.h>

struct State {
    int i, j, l;
};

struct Band {
    int lower, upper;
};

int sign(int a) {
    if (a < 0) return -1;
    if (a > 0) return 1;
    return 0;
}

int abs(int a) {
    if (a < 0) return -a;
    return a;
}

int mod(int a, int b) {
    return a - (a / b) * b;
}

int max(int a, int b) {
    if (a < b) return b;
    return a;
}

int min(int a, int b) {
    return (a + b) - max(a, b);
}

void entered_msg(struct State st, int k) {
    printf("(i, j) has entered the area, i = %d, j = %d, l = %d, k = %d \n", st.i, st.j, st.l, k);
}

void iter(struct State* st, int ck) {
    int ci = st->i, cj = st->j, cl = st->l;
    st->i = abs(ci - cl) + min(mod(cj, 10), mod(cl * ck, 10)) - 20;
    st->j = mod(max(ck - ci, min(cj, max(ci - cl, cj - cl))), 30);
    st->l = mod(cl * cl, 20) - mod(max(ci, cj), ck + 1);
}

void out(struct State st) {
    printf("(%d, %d, %d) \n", st.i, st.j, st.l);
}

void trace(struct State st, struct Band bnd) {
    int flag = 0;
    if (check(st, bnd)) {
        flag = 1;
        entered_msg(st, 0);
    }
    for (int k = 1;(k <= 50) && (flag == 0);k++) {
        iter(&st, k);
        out(st);
        if (check(st, bnd)) {
            flag = 1;
            entered_msg(st, k);
            break;
        }
    }
    if (flag == 0) {
        printf("(i, j) hasn't entered the area, i = %d, j = %d, l = %d \n", st.i, st.j, st.l);
    }
}
                    
int main() {
    struct State st = {-30, -4, 12};
    struct Band bnd = {-20, -10};
    trace(st, bnd);
    return 0;
}
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________

## 8. Распечатка протокола 

```
C:\Users\user\Desktop\Универ\лабы по инфе\9>gcc a.c

C:\Users\user\Desktop\Универ\лабы по инфе\9>a.exe
(i, j) has entered the area, i = 3, j = -14, l = -6, k = 7 
```

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 07.11.2022 | 18:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы

Замечаний нет.

## 11. Выводы

В процессе выполнения лабораторной работы были изучены особенности работы с целочисленным типом данных в Си. Были освоены базовые навыки написания итеративных программ на Си, которые используются для моделирования процессов и численных вычислений. Была получена практика по работе с указателями в языке Си.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________
