# Отчёт по лабораторной работе №12 по курсу “Фундаментальная информатика”

<b>Студент группы:</b> <ins>M80-108Б-22, Рамалданов Рустамхан Ражудинович, № по списку 17</ins> 

<b>Контакты e-mail:</b> <ins>mrpepelulka@gmail.com</ins>

<b>Работа выполнена:</b> «9» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>______</ins>

<b>Отчет сдан</b> «1» <ins>октября</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins>______</ins>

<b>Подпись преподавателя:</b> ________________

## 1. Тема
Обработка последовательности литер входного текстового файла. Простейшие приёмы лексического анализа. Диаграммы состояния и переходов.
## 2. Цель работы
Составить программу на языке Си, выполняющую анализ и обработку вводимого текста в соответствии с выданным преподавателем вариантом задания.
## 3. Задание (Вариант 17)
Поменять в числе местами первую и последнюю цифры.
## 4. Оборудование:
<b>Процессор:</b> 11th Gen intel(R) Core(TM) i5-11400H @ 2.70GHz<br/>
<b>ОП:</b> 16 ГБ<br/>
<b>SSD:</b> 512 ГБ<br/>
<b>Адрес:</b> 192.168.56.1 <br/>
<b>Монитор:</b> 1920x1080<br/>
<b>Графика:</b> Nvidia GeForce RTX 3050 Ti Laptop GPU <br/>

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> linux(ubuntu) версии 5.15.0-47-generic<br/>
<b>Интерпретатор команд:</b> bash версия 5.1.16<br/>
<b>Система программирования:</b> не использовалась версия —<br/>
<b>Редактор текстов:</b> emacs версия 25.2.2<br/>
<b>Утилиты операционной системы:</b> nano, ls, cd, touch, gcc <br/>
<b>Прикладные системы и программы:</b> GNU C compiler <br/>
<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b> /home/pepelulka<br/>

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)

Будем считывать из входного потока число и менять у него первую и последнюю цифры.

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 

Код программы: 
```src:a.c
#include <stdio.h>
#include <string.h>
#include <stdbool.h>

bool is_del(char c) {
    return (c == ' ') || (c == '\t') || (c == '\n') || (c == ',');
}

void swap(char* string, int ind1, int ind2) {
    char temp = string[ind1];
    string[ind1] = string[ind2];
    string[ind2] = temp;
}

void swap_and_print(char* buffer) {
    if (buffer[0] == '-' || buffer[0] == '+') swap(buffer, 1, strlen(buffer) - 1);
    else swap(buffer, 0, strlen(buffer) - 1);
    printf("%s\n", buffer);
}

void solve() {
    int ptr = 0;
    char cur;
    char buffer[12];

    cur = getchar();
    while (cur != EOF) {
        if (is_del(cur) && ptr != 0) {
            buffer[ptr] = '\0';
            swap_and_print(buffer);
            ptr = 0;
        }
        else if (!is_del(cur)) {
            buffer[ptr] = cur;
            ptr++;
        }
        cur = getchar();
    }
}

int main() {
    solve();
    return 0;
}  
```

Текст тестового файла:
```
123    234  345 0 
  +21382147
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________

## 8. Распечатка протокола 

```
C:\Users\user\Desktop\mai\inf_labs\Repository\Lab12-integers_in_C>a.exe < test.txt
321
432
543
0
+71382142
```

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 9.11.2022 | 18:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы

Замечаний нет.

## 11. Выводы

В процессе выполнения лабораторной работы были изучены простейшие приемы лексического анализа. Была лучше освоена работа со стандартными потоками ввода и вывода, были получены навыки работы со строками в Си.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________
