# Отчёт по лабораторной работе №12 по курсу “Фундаментальная информатика”

<b>Студент группы:</b> <ins>M80-108Б-22, Рамалданов Рустамхан Ражудинович, № по списку 17</ins> 

<b>Контакты e-mail:</b> <ins>mrpepelulka@gmail.com</ins>

<b>Работа выполнена:</b> «9» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>______</ins>

<b>Отчет сдан</b> «1» <ins>октября</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins>______</ins>

<b>Подпись преподавателя:</b> ________________

## 1. Тема
Обработка последовательности литер входного текстового файла. Простейшие приёмы лексического анализа. Диаграммы состояния и переходов.
## 2. Цель работы
Составить программу на языке Си, выполняющую анализ и обработку вводимого текста в соответствии с выданным преподавателем вариантом задания.
## 3. Задание (Вариант 17)
Выделить все числа, записанные в троичной системе счисления и кратные 3
## 4. Оборудование:
<b>Процессор:</b> 11th Gen intel(R) Core(TM) i5-11400H @ 2.70GHz<br/>
<b>ОП:</b> 16 ГБ<br/>
<b>SSD:</b> 512 ГБ<br/>
<b>Адрес:</b> 192.168.56.1 <br/>
<b>Монитор:</b> 1920x1080<br/>
<b>Графика:</b> Nvidia GeForce RTX 3050 Ti Laptop GPU <br/>

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> linux(ubuntu) версии 5.15.0-47-generic<br/>
<b>Интерпретатор команд:</b> bash версия 5.1.16<br/>
<b>Система программирования:</b> не использовалась версия —<br/>
<b>Редактор текстов:</b> emacs версия 25.2.2<br/>
<b>Утилиты операционной системы:</b> nano, ls, cd, touch, gcc <br/>
<b>Прикладные системы и программы:</b> GNU C compiler <br/>
<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b> /home/pepelulka<br/>

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)

Будем посимвольно считывать текст из потока входа, каждое новое слово записывая в строковую переменную. Встречая очередной разделитель, будем проверять слово на то, троичное ли это число, кратное 3, если да, то выводим слово в поток вывода.

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 

Код программы: 
```
#include <stdio.h>

int contain(char* str, int size, char c) {
    for (int i = 0;i < size;i++) {
        if (str[i] == c) return 1;
    }
    return 0;
}

int isdel(char c) {
    return contain(" ,\t\n", 4, c);
}

int isdigit3(char c) {
    return contain("012", 3, c);
}

void handler(char* str, int size) {
    int c1 = 1, c2 = 0, sc = 1; // Conditions: 1 - string must contain only digits(0-2) except of 1st character, which can be + or -, 2 - last digit is 0, 3 - special case condition
    // Handling special cases
    if (size == 0) sc = 0;
    if (size == 1 && (str[0] != '0')) sc = 0;
    
    if (!contain("012+-", 5, str[0])) c1 = 0;
    for (int i = 1;i < size - 1;i++) {
        if (!isdigit3(str[i])) c1 = 0;
    }
    if (size > 0 && str[size - 1] == '0') c2 = 1;

    if (c1 && c2 && sc) {
        printf("%s\n", str);
    }
}

int main() {
    char buffer[10000];
    int i = 0;
    char cur = getchar();

    while (cur != EOF) {
        if (isdel(cur)) {
            buffer[i] = '\0';
            handler(buffer, i);
            i = 0;
        }
        else {
            buffer[i] = cur;
            i++;
        }
        cur = getchar();
    }

    buffer[i] = '\0';
    handler(buffer, i);
    
    return 0;
}
```

Текст тестового файла:
```
abc asdasd as das
102 0000 +30 100 -200
34 100120a 100101 10120
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________

## 8. Распечатка протокола 

```
C:\Users\user\Desktop\Универ\лабы по инфе\11>gcc a.c

C:\Users\user\Desktop\Универ\лабы по инфе\11>a.exe < test.txt
0000
100
-200
10120
```

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 9.11.2022 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы

Замечаний нет.

## 11. Выводы

В процессе выполнения лабораторной работы были изучены простейшие приемы лексического анализа. Была лучше освоена работа со стандартными потоками ввода и вывода, были получены навыки работы со строками в Си.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________
