# Отчёт по лабораторной работе №13 по курсу “Фундаментальная информатика”

<b>Студент группы:</b> <ins>M80-108Б-22, Рамалданов Рустамхан Ражудинович, № по списку 17</ins> 

<b>Контакты e-mail:</b> <ins>mrpepelulka@gmail.com</ins>

<b>Работа выполнена:</b> «3» <ins>декабря</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>______</ins>

<b>Отчет сдан</b> «1» <ins>октября</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins>______</ins>

<b>Подпись преподавателя:</b> ________________

## 1. Тема
Множества
## 2. Цель работы
Составить программу проверки характеристик введенных последовательностей слов используя множества на языке Си.
## 3. Задание (Вариант 16)
Есть ли два соседних слова, согласные в которых совпадают.
## 4. Оборудование:
<b>Процессор:</b> 11th Gen intel(R) Core(TM) i5-11400H @ 2.70GHz<br/>
<b>ОП:</b> 16 ГБ<br/>
<b>SSD:</b> 512 ГБ<br/>
<b>Адрес:</b> 192.168.56.1 <br/>
<b>Монитор:</b> 1920x1080<br/>
<b>Графика:</b> Nvidia GeForce RTX 3050 Ti Laptop GPU <br/>

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> linux(ubuntu) версии 5.15.0-47-generic<br/>
<b>Интерпретатор команд:</b> bash версия 5.1.16<br/>
<b>Система программирования:</b> не использовалась версия —<br/>
<b>Редактор текстов:</b> emacs версия 25.2.2<br/>
<b>Утилиты операционной системы:</b> nano, ls, cd, touch, gcc <br/>
<b>Прикладные системы и программы:</b> GNU C compiler <br/>
<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b> /home/pepelulka<br/>

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)

Считываем по слову, сравнивая каждое новое с предыдущим. Для данного и предыдущего слов создаем по множеству согласных, входящих в слово, далее проверяем, чтобы их пересечение было ненулевым.

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 

Код программы:
```
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

typedef unsigned uint;
typedef uint64_t Set;

Set VOWELS =  ( \
    1U << ('a' - 'a') | \
    1U << ('e' - 'a') | \
    1U << ('i' - 'a') | \
    1U << ('o' - 'a') | \
    1U << ('u' - 'a') \
);


// Basic set functions
bool set_in(Set *x, uint index) {
    return (*x >> index) & 1;
}

void set_set(Set *x, uint index) {
    *x |= (1ULL << index);
}

void set_reset(Set *x, uint index) {
    *x &= ~(1ULL << index);
}

void set_clear(Set *x, uint index) {
    memset(x, 0, sizeof x);
}

void set_union(Set *x, Set *y) {
    *x |= *y;
}

void set_intersection(Set *x, Set *y) {
    *x &= *y;
}

void set_complement(Set *x) {
    *x = ~*x;
}

void set_difference(Set *x, Set *y) {
    *x &= ~*y;
}

// Main part of program

bool not_vowel(int code) {
    return !(set_in(&VOWELS, code));
}

bool check(char* string1, char* string2) {
    Set set1 = 0, set2 = 0;

    for (int ptr = 0;string1[ptr] != '\0';ptr++) {
        int code = (string1[ptr] - 'a');
        if (not_vowel(code)) set_set(&set1, code);
    }

    for (int ptr = 0;string2[ptr] != '\0';ptr++) {
        int code = (string2[ptr] - 'a');
        if (not_vowel(code)) set_set(&set2, code);
    }
    
    set_intersection(&set1, &set2);
    return set1 != 0;
}

void solve() {
    bool result = 0;
    char string1[10000], string2[10000];
    scanf("%s", string1); scanf("%s", string2);
    int previous = 1; // Who is previous now?

    while (1) {
        result = result || check(string1, string2);

        if (previous == 1) {
            if (scanf("%s", string1) == EOF) break;
            previous = 2;
        } else {
            if (scanf("%s", string2) == EOF) break;
            previous = 1;
        }
    }

    printf("%d", result);
}

int main(void) {
    solve();
    return 0;
}

```

Текст первого тестового файла:
```
abcbc akkko oasd uiiiiio aiii
```

Текст второго тестового файла:
```
asoasoii ooodsa uuu
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________

## 8. Распечатка протокола 

```
C:\Users\user\Desktop\Универ\лабы по инфе\labs\13>a.exe < test1.txt
0
C:\Users\user\Desktop\Универ\лабы по инфе\labs\13>a.exe < test2.txt 
1
```

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 03.12.2022 | 18:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы

Замечаний нет.

## 11. Выводы

В процессе выполнения лабораторной работы были изучены особенности реализации множеств на языке Си. Были разобраны реализации базовых операций на множествах. Получен опыт в решении задач с помощью 
множеств.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________
